XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AutoChips.AC7840x_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>AutoChips</vendor>
  <name>AC7840x_DFP</name>
  <description>AutoChips AC7840x Series Device Support, Drivers and Examples</description>
  <url>https://armfileget.autochips.com/CMSIS_PACK/AC7840x/</url>
  <supportContact>support@autochips.com</supportContact>

  <releases>
    <release version="3.0.3" date="2023-12-20">
      Update wdg_hw.h
	  - Change WDG lock status read function to macro funtion, decrease the excute time after unlock cause it may exceed the configurable time limit of WDG after compile in some compiler like Eclipse.
	  Update uart_drv.c
	  - Don't disable FIFO after receiving an error callback
	  Update ac7840x/startup/debugout_ac7840x.c
	  - fix arm clang compile error.
	  Update spi_slave_drv.c
	  - Because the SRAM L region restricts the use of DMA, the local variables of the buffer are not used when the slave is transmitted
	  Update can_hw.h can_hw.c
	  - Fix the problem that the CAN driver causes the STB to send multiple frames
    </release>
    <release version="3.0.2" date="2023-11-10">
      Add EEP module.
    </release>
    <release version="3.0.1" date="2023-11-03">
      ES3 release, SPM add standby mode.
    </release>
    <release version="2.0.5" date="2023-09-08">
      Update inc/uart_drv.h src/uart/uart_drv.c src/uart/uart_hw.h src/uart/uart_hw.c
      - Add UART interrupt: UART_INT_IDLE_LINE
      Update src/cse/cse_hw.h
      - Fix CSE CMAC calculate bug when length more than 112 byte
    </release>
    <release version="2.0.4" date="2023-08-09">
      Update spm_drv.c
      - Solving the problem of high sleep energy consumption when enabling XOSC+PLL
      Update AC7840X_P1024KB.FLM
      - Fix the issue of verification failure when downloading programs using J-Flash
    </release>
    <release version="2.0.3" date="2023-06-21">
      Update ckgen_drv/uart_drv.c
      - Optimize code
    </release>
    <release version="2.0.2" date="2023-06-07">
      Update eio_drv
      - Optimize code
    </release>
    <release version="2.0.1" date="2023-04-26">
      Update dma_drv.c
      - Restrict SRAM only SRAM_U
      update eio_i2c_drv.c/eio_i2s_drv.c/eio_spi_drv.c/spi_master_drv.c/spi_slave_drv.c/uart_drv.c/adc_drv
      - Add DMA return value judgment
    </release>
    <release version="2.0.0" date="2023-03-29">
      Optimize some code
    </release>
    <release version="1.1.0" date="2023-03-17">
      Updated uart_drv.c/uart_drv.h file
      - Optimize uart dma operation code
      Updated eio_i2s_drv.c/eio_hw.h file
      - Change some variable names
      Updated dma_drv.c file
      - Optimize dma clock operation code
      update ckgen_drv.c/ckgen_hw.c/uart_hw/eep_drv.c file
      - Fix IAR build waing and code ruler
      update pwm_common.c file
      - Optimize pwm combined mode operation code
      update spm_drv.c/adc_drv.c/system_ac7840x.h file
      - remove misa warning
      update svd file
      - remove some warning
    </release>
    <release version="1.0.2" date="2023-02-21">
      Updated uart_drv.c/uart_drv.h file
      - Optimize uart dma operation code
      Updated eep_drv.c file
      - Optimize eeprom operation code
    </release>
    <release version="1.0.1" date="2023-01-13">
      Updated eio_i2s_drv/eio_i2c_drv file
      - Some variable adds eio prefix
      - Optimize eio i2s operation code
      Updated flash_drv.c file
      - Optimize flash operation code
      Updated spi_master.c file
      - Used the right clock value
      Add eep driver code file
    </release>
    <release version="1.0.0" date="2022-12-09">
      First Release version of AC7840x Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>AutoChips</keyword>
	<keyword>Device Support</keyword>
    <keyword>AC7840x</keyword>
    <keyword>AC784x</keyword>
    <keyword>AC784</keyword>
  </keywords>

  <!-- devices section (mandatory for Device Family Packs) -->
  <devices>
    <family Dfamily="AC7840x Series" Dvendor="AutoChips:150">
      <processor  Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
      <description>
AC7840x product series of 32-bit automotive microcontrollers provides a highly integrated, high-reliability, low-power, safe and secure single-chip solution.
The AC7840x device family contains an ARM Cortex-M4 processor, running up to 120MHz with a versatile set of on-chip peripherals.
which cover the needs of a large variety of applications in the Automotive, Industrial and consumer markets.
Typical applications include motor drives and application control, Pump, Fans, Seat Control, Sunroof and industrial applications.
Supply Voltage range from 2.7 to 5.5V.
      </description>
        <!-- ************************  DebugDeviceUnlock start  **************************** -->
        <sequences>
            <sequence name="DebugDeviceUnlock">
                <block>
                    __var DAuthUserInput   = 0;
                    __var DAUTHSTATUS_Val  = 0;
                    __var DHCSR_Val        = 0;
                    __var SecureDebugEna   = 0;
                    __var SecureDebugAvail = 0;
                    __var DAuthVal         = 0;
                    __var Status           = 0;  // AP Status value
                    __var Uid1             = 0;
                    __var Uid2             = 0;
                    __var Uid3             = 0;
                    __var Uid4             = 0;
                    __var originalAp       = __ap;

                    //WriteDP(0x8, 0x00000000);
                    //Init AP CSW register
                    //WriteAP(0x00, 0x23000052);
                    //WriteAP(0x4, 0x20000000);
                    //WriteAP(0xC, 0xA5A5A5A5);
                    //      Read32(0x20000000);

                    __ap = 0x78;
                    //      ReadAP(0x00);
                    //      ReadAP(0x04);
                    //      ReadAP(0x08);
                    //      ReadAP(0x0C);
                    //      WriteAP(0x10,0x5a5a5a5a);
                    //      WriteAP(0x14, 0x12345678);

                    __ap = originalAp;

                    __ap = 1;
                    WriteAP(0x08,0x00000001);
                    DAP_Delay(100000);
                    DAUTHSTATUS_Val = ReadAP(0x00);
                    SecureDebugAvail = (DAUTHSTATUS_Val &amp; 0x00000001) ? 1 : 0;
                </block>
                <control if="SecureDebugAvail == 1">
                    <block>
                        __ap = 1;
                        DAuthUserInput = Query(1, "Enable Secure Debug?", 3);
                    </block>
                    <control if="DAuthUserInput == 3">
                        <block>
                            WriteAP(0x04,0x00000001);
                            DAP_Delay(200000);
                        </block>
                    </control>
                    <control if="DAuthUserInput != 3">
                        <block>
                            WriteAP(0x04,0x00000000);
                        </block>
                    </control>
                </control>

                <block>
                    DAUTHSTATUS_Val = ReadAP(0x00);
                    SecureDebugAvail = (DAUTHSTATUS_Val &amp; 0x00000001) ? 1 : 0;
                </block>
                <control if="SecureDebugAvail != 1">
                    <block>
                        __ap = originalAp;
                        Write32(0xE000EDF0, 0xA05F0000 | 0x00000002 | 0x00000001);
                    </block>
                </control>
                <block>
                    __ap = 1;
                    WriteAP(0x08,0x00000000);
                </block>
            </sequence>
        </sequences>
        <!-- ************************  DebugDeviceUnlock end  **************************** -->

        <!-- ************************  Subfamily 'AC7840x'  **************************** -->
        <subFamily DsubFamily="AC7840x">
          <compile header="Device/ac7840x/include/ac7840x.h"/>
          <debug svd="SVD/AC7840x.svd"/>
          <feature    type="VCC"         n="2.7"     m="5.5"/>
          <feature    type="RTC"         n="32768"/>
          <feature    type="UART"        n="4"/>
          <feature    type="I2C"         n="1"/>
          <feature    type="SPI"         n="3"/>
          <feature    type="LIN"         n="4"         name="UART LIN"/>
          <feature    type="Crypto"      n="1"         name="CSE"/>
          <feature    type="Temp"        n="-40"     m="125"/>
          <feature    type="DMA"         n="16"/>
          <feature    type="Timer"       n="4"       m="32"/>
          <feature    type="WDT"         n="2"         name="Watchdog"/>
          <feature    type="TimerOther"                name="EWDG"/>
          <feature    type="TimerOther"  n="1"         name="Pulse Count Timer"/>
          <feature    type="TimerOther"  n="1"         name="Programmable Delay Timer"/>
          <feature    type="AnalogOther" n="1"         name="Analog Comparator"/>
          <feature    type="Other"       n="1"         name="eIO"/>

          <!-- *************************  Device 'AC78409YGLA'  ***************************** -->
          <device Dname="AC78409YGLA">
            <feature    type="IOs"         n="128"/>
            <feature    type="CAN"         n="4"/>
            <feature    type="PWM"         n="48"/>
            <feature    type="ADC"         n="48"/>
            <feature    type="QFP"         n="144"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="6"      name="RUN, STOP1, STOP2, VLPR, VLPS, Standby"/>
            <feature    type="Other"                  name="ISELED"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00100000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78409LGLA'  ***************************** -->
          <device Dname="AC78409LGLA">
            <feature    type="IOs"         n="89"/>
            <feature    type="CAN"         n="4"/>
            <feature    type="PWM"         n="39"/>
            <feature    type="ADC"         n="32"/>
            <feature    type="QFP"         n="100"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="6"      name="RUN, STOP1, STOP2, VLPR, VLPS, Standby"/>
            <feature    type="Other"                  name="ISELED"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00100000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

