XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AutoChips.AC7840x_DFP.pdsc
          <!-- *************************  Device 'AC78408HFLA'  ***************************** -->
          <device Dname="AC78408HFLA">
            <feature    type="IOs"         n="58"/>
            <feature    type="CAN"         n="3"/>
            <feature    type="PWM"         n="36"/>
            <feature    type="ADC"         n="29"/>
            <feature    type="QFP"         n="64"     name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="6"      name="RUN, STOP1, STOP2, VLPR, VLPS, Standby"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00080000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78407YGLA'  ***************************** -->
          <device Dname="AC78407YGLA">
            <feature    type="IOs"         n="128"/>
            <feature    type="CAN"         n="4"/>
            <feature    type="PWM"         n="48"/>
            <feature    type="ADC"         n="48"/>
            <feature    type="QFP"         n="144"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"      name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <feature    type="Other"                  name="ISELED"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00100000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78407LGLA'  ***************************** -->
          <device Dname="AC78407LGLA">
            <feature    type="IOs"         n="89"/>
            <feature    type="CAN"         n="4"/>
            <feature    type="PWM"         n="39"/>
            <feature    type="ADC"         n="32"/>
            <feature    type="QFP"         n="100"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"      name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <feature    type="Other"                  name="ISELED"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00100000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78407HGLA'  ***************************** -->
          <device Dname="AC78407HGLA">
            <feature    type="IOs"         n="58"/>
            <feature    type="CAN"         n="3"/>
            <feature    type="PWM"         n="36"/>
            <feature    type="ADC"         n="29"/>
            <feature    type="QFP"         n="64"     name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"      name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <feature    type="Other"                  name="ISELED"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00100000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78407LFLA'  ***************************** -->
          <device Dname="AC78407LFLA">
            <feature    type="IOs"         n="89"/>
            <feature    type="CAN"         n="4"/>
            <feature    type="PWM"         n="39"/>
            <feature    type="ADC"         n="32"/>
            <feature    type="QFP"         n="100"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"      name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <feature    type="Other"                  name="ISELED"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00080000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78407HFLA'  ***************************** -->
          <device Dname="AC78407HFLA">
            <feature    type="IOs"         n="58"/>
            <feature    type="CAN"         n="3"/>
            <feature    type="PWM"         n="36"/>
            <feature    type="ADC"         n="29"/>
            <feature    type="QFP"         n="64"     name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"      name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <feature    type="Other"                  name="ISELED"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00080000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78406YGLA'  ***************************** -->
          <device Dname="AC78406YGLA">
            <feature    type="IOs"         n="128"/>
            <feature    type="CAN"         n="4"/>
            <feature    type="PWM"         n="48"/>
            <feature    type="ADC"         n="48"/>
            <feature    type="QFP"         n="144"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"    name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00100000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78406LGLA'  ***************************** -->
          <device Dname="AC78406LGLA">
            <feature    type="IOs"         n="89"/>
            <feature    type="CAN"         n="4"/>
            <feature    type="PWM"         n="39"/>
            <feature    type="ADC"         n="32"/>
            <feature    type="QFP"         n="100"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"    name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00100000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

