XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AutoChips.AC7840x_DFP.pdsc
          <!-- *************************  Device 'AC78406HGLA'  ***************************** -->
          <device Dname="AC78406HGLA">
            <feature    type="IOs"         n="58"/>
            <feature    type="CAN"         n="3"/>
            <feature    type="PWM"         n="36"/>
            <feature    type="ADC"         n="29"/>
            <feature    type="QFP"         n="64"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"    name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00100000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78406YFLA'  ***************************** -->
          <device Dname="AC78406YFLA">
            <feature    type="IOs"         n="128"/>
            <feature    type="CAN"         n="4"/>
            <feature    type="PWM"         n="48"/>
            <feature    type="ADC"         n="48"/>
            <feature    type="QFP"         n="144"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"    name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00080000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78406LFLA'  ***************************** -->
          <device Dname="AC78406LFLA">
            <feature    type="IOs"         n="89"/>
            <feature    type="CAN"         n="4"/>
            <feature    type="PWM"         n="39"/>
            <feature    type="ADC"         n="32"/>
            <feature    type="QFP"         n="100"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"    name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00080000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>

          <!-- *************************  Device 'AC78406HFLA'  ***************************** -->
          <device Dname="AC78406HFLA">
            <feature    type="IOs"         n="58"/>
            <feature    type="CAN"         n="3"/>
            <feature    type="PWM"         n="36"/>
            <feature    type="ADC"         n="29"/>
            <feature    type="QFP"         n="64"    name="Low-Profile QFP Package"/>
            <feature    type="PowerMode"   n="5"    name="RUN, STOP1, STOP2, VLPR, VLPS"/>
            <memory     id="IROM1"                        start="0x00000000"  size="0x00080000"  startup="1"     default="1"/>
            <memory     id="IRAM1"                        start="0x1FFF0000"  size="0x00010000"  init ="0"       default="1"/>
            <memory     id="IRAM2"                        start="0x20000000"  size="0x0000F000"  init ="0"       default="1"/>
            <algorithm  name="Flash/AC7840X_P1024KB.FLM"  start="0x00000000"  size="0x00100000"  default="1"/>
          </device>
        </subFamily>
    </family>
  </devices>

  <!-- conditions section (optional for all Software Packs)-->
  <conditions>
    <condition id="AC7840x CMSIS-CORE">
      <!-- conditions selecting Devices -->
      <description>AutoChips AC784x Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="AutoChips:150" Dname="AC7840[6789]*"/>
      <require Dfamily="AC7840x Series"/>
      <require Tcompiler="ARMCC"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="CKGEN"/>
    </condition>


	<condition id="AC7840x System">
      <description>AutoChips AC784x System</description>
		  <require condition="AC7840x CMSIS-CORE"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="CKGEN"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>

    <condition id="AC7840x UART Driver Require">
      <description>AutoChips AC784x UART Driver</description>
          <require condition="AC7840x System"/>
      <require Cclass="Device" Cgroup="ATC OSIF" Csub="OSIF"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="DMA"/>
    </condition>

    <condition id="AC7840x CKGEN Driver Require">
      <description>AutoChips AC784x RCM Driver</description>
		  <require condition="AC7840x System"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="RCM"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="SPM"/>
    </condition>

    <condition id="AC7840x FLASH Require">
      <!-- conditions selecting Devices -->
      <description>AutoChips AC784x Series FLASH Require</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="AutoChips:150" Dname="AC7840[6789]*"/>
      <require Dfamily="AC7840x Series"/>
      <require Tcompiler="ARMCC"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>

    <condition id="AC7840x Debug Interface">
      <description>AutoChips AC784x Development Kit Debug Interface</description>
      <require condition="AC7840x System"/>
	  <require Cclass="Device" Cgroup="ATC Drivers" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="UART"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>

    <condition id="AC7840x EIO Driver Require">
      <description>AutoChips AC784x EIO Driver</description>
      <require condition="AC7840x System"/>
      <require Cclass="Device" Cgroup="ATC OSIF"    Csub="OSIF"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="DMA"/>
    </condition>

