XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AutoChips.AC7840x_DFP.pdsc
    <condition id="AC7840x I2C Driver Require">
      <description>AutoChips AC784x I2C Driver</description>
      <require condition="AC7840x System"/>
      <require Cclass="Device" Cgroup="ATC OSIF"    Csub="OSIF"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="DMA"/>
    </condition>

    <condition id="AC7840x LIN Driver Require">
      <description>AutoChips AC784x LIN Driver</description>
      <require condition="AC7840x System"/>
      <require Cclass="Device" Cgroup="ATC OSIF"    Csub="OSIF"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="UART"/>
    </condition>

    <condition id="AC7840x SPI Driver Require">
      <description>AutoChips AC784x SPI Driver</description>
      <require condition="AC7840x System"/>
      <require Cclass="Device" Cgroup="ATC OSIF"    Csub="OSIF"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="DMA"/>
    </condition>

    <condition id="AC7840x CSE Driver Require">
      <description>AutoChips AC784x CSE Driver</description>
      <require condition="AC7840x System"/>
      <require Cclass="Device" Cgroup="ATC OSIF"    Csub="OSIF"/>
      <require Cclass="Device" Cgroup="ATC Drivers" Csub="CSE"/>
    </condition>


  </conditions>

  <!-- component section (optional for all Software Packs)-->
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="AC7840x CMSIS-CORE">
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_AC7840x
      </RTE_Components_h>
      <description>System Startup for AutoChips AC7840x Series</description>
      <files>
        <!-- startup files -->
        <file category="sourceAsm"  name="Device/ac7840x/startup/armc/startup_ac7840x.s" attr="config" version="1.0.0"/>
        <!-- system file -->
        <file category="header"  name="Device/ac7840x/include/ac7840x.h"                              version="1.0.0"/>
        <file category="source"  name="Device/ac7840x/startup/system_ac7840x.c"         attr="config" version="1.0.0"/>
        <file category="header"  name="Device/ac7840x/startup/system_ac7840x.h"         attr="config" version="1.0.0"/>
        <file category="header"  name="Device/ac7840x/include/ac7840x_features.h"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/device_assert.h"                          attr="config" version="1.0.0"/>
        <file category="header"  name="Device/device_register.h"                        attr="config" version="1.0.0"/>
        <file category="header"  name="Device/device_status.h"                          attr="config" version="1.0.0"/>
        <!-- <file category="header"  name="Device/common/AC784x_core_cm4.h"                 attr="config" version="1.0.0"/> -->
      </files>
    </component>

     <!-- START: AutoChips AC784x Peripherals Drivers -->
    <component Cclass="Device" Cgroup="ATC Drivers" Csub="ACMP" Cversion="1.0.0" condition="AC7840x System">
      <description>Analog-Comparator (ACMP) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ACMP
      </RTE_Components_h>
      <files>
        <file category="header" name="Driver/inc/acmp_drv.h"/>
        <file category="header" name="Driver/src/acmp/acmp_hw.h"/>
        <file category="source" name="Driver/src/acmp/acmp_drv.c"/>
		<file category="source" name="Driver/src/acmp/acmp_hw.c"/>
		<file category="source" name="Driver/src/acmp/acmp_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="ADC" Cversion="1.0.0" condition="AC7840x System">
      <description>Analog-to-digital converter (ADC) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ADC
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/adc_drv.h"/>
		<file category="header" name="Driver/src/adc/adc_hw.h"/>
		<file category="source" name="Driver/src/adc/adc_drv.c"/>
		<file category="source" name="Driver/src/adc/adc_hw.c"/>
		<file category="source" name="Driver/src/adc/adc_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="CAN" Cversion="1.0.0" condition="AC7840x System">
      <description>Controller area network (CAN) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CAN
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/can_drv.h"/>
		<file category="header" name="Driver/src/can/can_hw.h"/>
		<file category="source" name="Driver/src/can/can_drv.c"/>
		<file category="source" name="Driver/src/can/can_hw.c"/>
		<file category="source" name="Driver/src/can/can_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="CKGEN" Cversion="1.0.0" condition="AC7840x CKGEN Driver Require">
      <description>Clock generator (CKGEN) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CKGEN
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/ckgen_drv.h"/>
		<file category="header" name="Driver/src/ckgen/ckgen_hw.h"/>
		<file category="source" name="Driver/src/ckgen/ckgen_drv.c"/>
		<file category="source" name="Driver/src/ckgen/ckgen_hw.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="CMU" Cversion="1.0.0" condition="AC7840x System">
      <description>Clock monitor unit (CMU) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CMU
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/cmu_drv.h"/>
		<file category="header" name="Driver/src/cmu/cmu_hw.h"/>
		<file category="source" name="Driver/src/cmu/cmu_drv.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="CRC" Cversion="1.0.0" condition="AC7840x System">
      <description>Cyclic redundancy check (CRC) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CRC
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/crc_drv.h"/>
		<file category="header" name="Driver/src/crc/crc_hw.h"/>
		<file category="source" name="Driver/src/crc/crc_drv.c"/>
		<file category="source" name="Driver/src/crc/crc_hw.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="CSE" Cversion="1.0.0" condition="AC7840x CSE Driver Require">
      <description>Cryptographic service engine (CSE) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CSE
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/cse_drv.h"/>
		<file category="header" name="Driver/src/cse/cse_hw.h"/>
		<file category="source" name="Driver/src/cse/cse_drv.c"/>
		<file category="source" name="Driver/src/cse/cse_hw.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="CTU" Cversion="1.0.0" condition="AC7840x System">
      <description>Connection unit (CTU) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CTU
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/ctu_drv.h"/>
		<file category="header" name="Driver/src/ctu/ctu_hw.h"/>
		<file category="source" name="Driver/src/ctu/ctu_drv.c"/>
		<file category="source" name="Driver/src/ctu/ctu_hw.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="DMA" Cversion="1.0.0" condition="AC7840x System">
      <description>Direct memory access (DMA) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_DMA
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/dma_drv.h"/>
		<file category="header" name="Driver/src/dma/dma_hw.h"/>
		<file category="source" name="Driver/src/dma/dma_drv.c"/>
		<file category="source" name="Driver/src/dma/dma_hw.c"/>
		<file category="source" name="Driver/src/dma/dma_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="EIM" Cversion="1.0.0" condition="AC7840x System">
      <description>Error injection module(EIM) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ECC_EIM
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/eim_drv.h"/>
		<file category="header" name="Driver/src/eim/eim_hw.h"/>
		<file category="source" name="Driver/src/eim/eim_drv.c"/>
		<file category="source" name="Driver/src/eim/eim_hw.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="EIO" Cversion="1.0.0" condition="AC7840x EIO Driver Require">
      <description>Enhanced input and output (EIO) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EIO
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/eio.h"/>
		<file category="header" name="Driver/src/eio/eio_hw.h"/>
		<file category="header" name="Driver/src/eio/eio_comm.h"/>
		<file category="source" name="Driver/src/eio/eio_comm.c"/>
		<file category="source" name="Driver/src/eio/eio_i2c_drv.c"/>
		<file category="source" name="Driver/src/eio/eio_i2s_drv.c"/>
		<file category="source" name="Driver/src/eio/eio_spi_drv.c"/>
		<file category="source" name="Driver/src/eio/eio_uart_drv.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="EWDG" Cversion="1.0.0" condition="AC7840x System">
      <description>External watchdog (EWDG) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EWDG
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/ewdg_drv.h"/>
		<file category="header" name="Driver/src/ewdg/ewdg_hw.h"/>
		<file category="source" name="Driver/src/ewdg/ewdg_drv.c"/>
		<file category="source" name="Driver/src/ewdg/ewdg_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="EFLASH" Cversion="1.0.0" condition="AC7840x FLASH Require">
      <description>Embedded Flash memory (eFlash) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EFLASH
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/flash_drv.h"/>
		<file category="header" name="Driver/src/flash/flash_hw.h"/>
		<file category="source" name="Driver/src/flash/flash_drv.c"/>
		<file category="source" name="Driver/src/flash/flash_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="GPIO" Cversion="1.0.0" condition="AC7840x System">
      <description>General-purpose I/O (GPIO) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_GPIO
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/gpio_drv.h"/>
		<file category="header" name="Driver/src/gpio/gpio_hw.h"/>
		<file category="header" name="Driver/src/gpio/port_hw.h"/>
		<file category="source" name="Driver/src/gpio/gpio_drv.c"/>
		<file category="source" name="Driver/src/gpio/port_hw.c"/>
		<file category="source" name="Driver/src/gpio/gpio_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="I2C" Cversion="1.0.0" condition="AC7840x I2C Driver Require">
      <description>Inter-integrated circuit (I2C) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_I2C
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/i2c_drv.h"/>
		<file category="header" name="Driver/src/i2c/i2c_hw.h"/>
		<file category="source" name="Driver/src/i2c/i2c_drv.c"/>
		<file category="source" name="Driver/src/i2c/i2c_hw.c"/>
		<file category="source" name="Driver/src/i2c/i2c_irq.c"/>
      </files>
    </component>

