XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AutoChips.AC7840x_DFP.pdsc
    <component Cclass="Device" Cgroup="ATC Drivers" Csub="LIN" Cversion="1.0.0" condition="AC7840x LIN Driver Require">
      <description>Local interconnect network (LIN) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LIN
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/lin_drv.h"/>
		<file category="source" name="Driver/src/lin/lin_drv.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="MPU" Cversion="1.0.0" condition="AC7840x System">
      <description>Memory protect unit (MPU) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_MPU
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/mpu_drv.h"/>
		<file category="header" name="Driver/src/mpu/mpu_hw.h"/>
		<file category="source" name="Driver/src/mpu/mpu_drv.c"/>
		<file category="source" name="Driver/src/mpu/mpu_hw.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="PBR" Cversion="1.0.0" condition="AC7840x System">
      <description>Peripheral bridge (PBR) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PBR
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/pbr_drv.h"/>
		<file category="header" name="Driver/src/pbr/pbr_hw.h"/>
		<file category="source" name="Driver/src/pbr/pbr_drv.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="PCT" Cversion="1.0.0" condition="AC7840x System">
      <description>Pulse counting timer (PCT) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PCT
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/pct_drv.h"/>
		<file category="header" name="Driver/src/pct/pct_hw.h"/>
		<file category="source" name="Driver/src/pct/pct_drv.c"/>
		<file category="source" name="Driver/src/pct/pct_hw.c"/>
		<file category="source" name="Driver/src/pct/pct_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="PDT" Cversion="1.0.0" condition="AC7840x System">
      <description>Programmable delay timer (PDT) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PDT
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/pdt_drv.h"/>
		<file category="header" name="Driver/src/pdt/pdt_hw.h"/>
		<file category="source" name="Driver/src/pdt/pdt_drv.c"/>
		<file category="source" name="Driver/src/pdt/pdt_hw.c"/>
		<file category="source" name="Driver/src/pdt/pdt_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="PWM" Cversion="1.0.0" condition="AC7840x System">
      <description>Pulse Width Modulation (PWM) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PWM
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/pwm_common.h"/>
		<file category="header" name="Driver/inc/pwm_input.h"/>
		<file category="header" name="Driver/inc/pwm_output.h"/>
		<file category="header" name="Driver/src/pwm/pwm_hw.h"/>
		<file category="source" name="Driver/src/pwm/pwm_common.c"/>
		<file category="source" name="Driver/src/pwm/pwm_hw.c"/>
		<file category="source" name="Driver/src/pwm/pwm_input.c"/>
		<file category="source" name="Driver/src/pwm/pwm_output.c"/>
		<file category="source" name="Driver/src/pwm/pwm_irq.c"/>
      </files>
    </component>

	<component Cclass="Device" Cgroup="ATC Drivers" Csub="RCM" Cversion="1.0.0" condition="AC7840x System">
      <description>Reset control module(RCM) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_RCM
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/rcm_drv.h"/>
		<file category="header" name="Driver/src/rcm/rcm_hw.h"/>
		<file category="source" name="Driver/src/rcm/rcm_drv.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="RTC" Cversion="1.0.0" condition="AC7840x System">
      <description>Real-time clock (RTC) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_RTC
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/rtc_drv.h"/>
		<file category="header" name="Driver/src/rtc/rtc_hw.h"/>
		<file category="source" name="Driver/src/rtc/rtc_drv.c"/>
		<file category="source" name="Driver/src/rtc/rtc_hw.c"/>
		<file category="source" name="Driver/src/rtc/rtc_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="SMU" Cversion="1.0.0" condition="AC7840x System">
      <description>Safety management unit(SMU) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SMU
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/smu_drv.h"/>
		<file category="header" name="Driver/src/smu/smu_hw.h"/>
		<file category="source" name="Driver/src/smu/smu_drv.c"/>
		<file category="source" name="Driver/src/smu/smu_hw.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="SPI" Cversion="1.0.0" condition="AC7840x SPI Driver Require">
      <description>Serial peripheral interface (SPI) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SPI
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/spi_master_drv.h"/>
		<file category="header" name="Driver/inc/spi_shared_function.h"/>
		<file category="header" name="Driver/inc/spi_slave_drv.h"/>
		<file category="header" name="Driver/src/spi/spi_hw.h"/>
		<file category="source" name="Driver/src/spi/spi_irq.c"/>
		<file category="source" name="Driver/src/spi/spi_hw.c"/>
		<file category="source" name="Driver/src/spi/spi_master_drv.c"/>
		<file category="source" name="Driver/src/spi/spi_shared_function.c"/>
		<file category="source" name="Driver/src/spi/spi_slave_drv.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="SPM" Cversion="1.0.0" condition="AC7840x System">
      <description>System power management (SPM) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SPM
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/spm_drv.h"/>
		<file category="header" name="Driver/src/spm/spm_hw.h"/>
		<file category="source" name="Driver/src/spm/spm_drv.c"/>
		<file category="source" name="Driver/src/spm/spm_irq.c"/>
      </files>
    </component>

