XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/AutoChips.AC7840x_DFP.pdsc
    <component Cclass="Device" Cgroup="ATC Drivers" Csub="SRAM" Cversion="1.0.0" condition="AC7840x System">
      <description>Static random-access memory (SRAM) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SRAM
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/sram_drv.h"/>
		<file category="header" name="Driver/src/sram/sram_hw.h"/>
		<file category="source" name="Driver/src/sram/sram_drv.c"/>
		<file category="source" name="Driver/src/sram/sram_hw.c"/>
		<file category="source" name="Driver/src/sram/sram_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="TIMER" Cversion="1.0.0" condition="AC7840x System">
      <description>Timer (TIMER) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_TIMER
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/timer_drv.h"/>
		<file category="header" name="Driver/src/timer/timer_hw.h"/>
		<file category="source" name="Driver/src/timer/timer_drv.c"/>
		<file category="source" name="Driver/src/timer/timer_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="UART" Cversion="1.0.0" condition="AC7840x UART Driver Require">
      <description>Universal asynchronous receiver transmitter (UART) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_UART
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/uart_drv.h"/>
		<file category="header" name="Driver/src/uart/uart_hw.h"/>
		<file category="header" name="Driver/src/uart/uart_irq.h"/>
		<file category="source" name="Driver/src/uart/uart_drv.c"/>
		<file category="source" name="Driver/src/uart/uart_hw.c"/>
		<file category="source" name="Driver/src/uart/uart_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="WDG" Cversion="1.0.0" condition="AC7840x System">
      <description>Watchdog (WDG) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_WDG
      </RTE_Components_h>
      <files>
		<file category="header" name="Driver/inc/wdg_drv.h"/>
		<file category="header" name="Driver/src/wdg/wdg_hw.h"/>
		<file category="source" name="Driver/src/wdg/wdg_drv.c"/>
		<file category="source" name="Driver/src/wdg/wdg_hw.c"/>
		<file category="source" name="Driver/src/wdg/wdg_irq.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ATC Drivers" Csub="EEP" Cversion="1.0.0" condition="AC7840x System">
      <description>EEPROM (EEP) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EEP
      </RTE_Components_h>
      <files>
        <file category="header" name="Driver/inc/eep_drv.h"/>
        <file category="source" name="Driver/src/eep/eep_drv.lib"/>
      </files>
    </component>
    <!-- END: AutoChips AC784x Peripherals Drivers -->

    <component Cclass="Device" Cgroup="ATC OSIF" Csub="OSIF" Cvariant="Bare Metal" Cversion="1.0.0" condition="AC7840x System">
      <description>Bare Metal Abstraction Layer(no RTOS)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_OSIF
      </RTE_Components_h>
      <files>
		<file category="header" name="Rtos/osif/osif.h"/>
		<file category="source" name="Rtos/osif/osif_baremetal.c"/>
      </files>
    </component>

    <!-- AutoChips AC784x Development Board -->
    <bundle Cbundle="AC7840x Development Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>AutoChips AC784x Development Board </description>
      <doc></doc>
      <component Cgroup="AC7840x Development Kit" Csub="Debug" Cvariant="AC7840x Development Kit" condition="AC7840x Debug Interface">
        <description>Debug Interface for AutoChips AC784x Development Board</description>
        <files>
          <file category="header" name="Device/ac7840x/startup/debugout_ac7840x.h"/>
          <file category="source" name="Device/ac7840x/startup/debugout_ac7840x.c" attr="config" version="1.0.0"/>
        </files>
      </component>
    </bundle>
  </components>

</package>

